#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
google_project_iam_audit_config.storage_logging: Refreshing state... [id=workload-idenity-federation/audit_config/storage.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iam.googleapis.com]
google_project_service.enable_api["storage.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/storage.googleapis.com]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iamcredentials.googleapis.com]
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/cloudresourcemanager.googleapis.com]
google_storage_bucket.test001: Refreshing state... [id=workload-idenity-federation-bucket-test001]
google_project_service.enable_api["sts.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/sts.googleapis.com]
data.google_service_account.terraform-sa: Reading...
data.google_monitoring_notification_channel.gcs_unknown_access_notify_channel: Reading...
google_iam_workload_identity_pool.my-wif-pool: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool]
data.google_service_account.terraform-sa: Read complete after 1s [id=projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.serviceAccountViewer"]: Refreshing state... [id=workload-idenity-federation/roles/iam.serviceAccountViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/resourcemanager.projectIamAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/serviceusage.serviceUsageViewer"]: Refreshing state... [id=workload-idenity-federation/roles/serviceusage.serviceUsageViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/storage.admin"]: Refreshing state... [id=workload-idenity-federation/roles/storage.admin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.my-wif-provider: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool/providers/my-wif-provider]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/524220704155/locations/global/workloadIdentityPools/my-wif-pool/attribute.repository/nevenisnoob/WorkloadIdentityFederation]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_project_iam_audit_config.enable_gcs_logging will be created
  + resource "google_project_iam_audit_config" "enable_gcs_logging" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + project = "workload-idenity-federation"
      + service = "storage.googleapis.com"

      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_READ"
        }
      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_WRITE"
        }
    }

  # google_project_iam_custom_role.terraform-ci will be created
  + resource "google_project_iam_custom_role" "terraform-ci" {
      + deleted     = (known after apply)
      + description = "TerraformCIのCustomRole"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "resourcemanager.projects.getIamPolicy",
        ]
      + project     = (known after apply)
      + role_id     = "TerraformCI"
      + title       = "Terraform CI Custom Role"
    }

  # google_project_iam_member.terraform-role will be created
  + resource "google_project_iam_member" "terraform-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com"
      + project = "workload-idenity-federation"
      + role    = "roles/monitoring.editor"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```
</details>
*Pusher: @nevenisnoob, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*